
## Terraform plan for environment: `dev`

**Commit:** 9da5c39138d70013a18d214d2f60347c1574d7fa


**API version:** cedac7a93d
**CLI version:** cedac7a93d
**Selfserve version:** release-v6.1.4
**Internal version:** 94f1a9e0de

### Plan summary

`1 to add, 5 to change, 0 to destroy`

**🆕 Creates**

```tf
module.service.aws_lb_listener_rule.renderer-batch[0]
```
**📖 Reads**

```tf
module.service.module.eventbridge.data.aws_iam_policy_document.additional_inline[0]
```
**🔄 Updates**

```tf
module.service.module.batch.aws_batch_job_definition.this["import-anondb"]
module.service.module.batch.aws_batch_job_definition.this["ni-compliance"]
module.service.module.batch.aws_batch_job_definition.this["populate-anondb"]
module.service.module.batch.aws_batch_job_definition.this["sas-mi-extract"]
module.service.module.eventbridge.aws_iam_policy.additional_inline[0]
```


----

<details data-gh-workflow="dev-environment-plan"><summary>Show full plan</summary>

```tf


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.service.aws_lb_listener_rule.renderer-batch[0] will be created
  + resource "aws_lb_listener_rule" "renderer-batch" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = "arn:aws:elasticloadbalancing:eu-west-1:054614622558:listener/app/DEVAPPDEV-OLCS-PRI-SVCS-ALB/969f6a43be729deb/bc13f31526969a23"
      + priority     = 87
      + tags_all     = {
          + "Environment" = "dev"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }

      + action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:eu-west-1:054614622558:targetgroup/vol-app-dev-pdf-converter-tg/bf75a4dc1fd8561b"
          + type             = "forward"
        }

      + condition {
          + host_header {
              + values = [
                  + "renderer.*",
                ]
            }
        }
      + condition {
          + source_ip {
              + values = [
                  + "10.161.36.144/28",
                  + "10.161.36.160/28",
                  + "10.161.36.176/28",
                ]
            }
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["import-anondb"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-import-anondb:244" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  - {
                      - name  = "APP_VERSION"
                      - value = "cedac7a93d"
                    },
                  - {
                      - name  = "DOMAIN"
                      - value = "dev-dvsacloud.uk"
                    },
                    {
                        name  = "ENVIRONMENT_NAME"
                        value = "DEV"
                    },
                    {
                        name  = "FULL_DOMAIN"
                        value = "dev.olcs.dev-dvsacloud.uk"
                    },
                  + {
                      + name  = "DOMAIN"
                      + value = "dev-dvsacloud.uk"
                    },
                  + {
                      + name  = "READDB_HOST"
                      + value = "olcsreaddb-rds.dev.olcs.dev-dvsacloud.uk"
                    },
                    {
                        name  = "PROXY"
                        value = "proxy.dev.olcs.dev-dvsacloud.uk:3128"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "cedac7a93d"
                    },
                    {
                        name  = "READDB_HOST"
                        value = "olcsreaddb-rds.dev.olcs.dev-dvsacloud.uk"
                    },
                ]
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (8 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-import-anondb:244"
        name                       = "vol-app-dev-import-anondb"
      ~ revision                   = 244 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["ni-compliance"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-ni-compliance:244" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  - {
                      - name  = "APP_VERSION"
                      - value = "cedac7a93d"
                    },
                  - {
                      - name  = "DOMAIN"
                      - value = "dev-dvsacloud.uk"
                    },
                    {
                        name  = "ENVIRONMENT_NAME"
                        value = "DEV"
                    },
                    {
                        name  = "FULL_DOMAIN"
                        value = "dev.olcs.dev-dvsacloud.uk"
                    },
                  + {
                      + name  = "DOMAIN"
                      + value = "dev-dvsacloud.uk"
                    },
                  + {
                      + name  = "READDB_HOST"
                      + value = "olcsreaddb-rds.dev.olcs.dev-dvsacloud.uk"
                    },
                    {
                        name  = "PROXY"
                        value = "proxy.dev.olcs.dev-dvsacloud.uk:3128"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "cedac7a93d"
                    },
                    {
                        name  = "READDB_HOST"
                        value = "olcsreaddb-rds.dev.olcs.dev-dvsacloud.uk"
                    },
                ]
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (8 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-ni-compliance:244"
        name                       = "vol-app-dev-ni-compliance"
      ~ revision                   = 244 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["populate-anondb"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-populate-anondb:244" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  - {
                      - name  = "APP_VERSION"
                      - value = "cedac7a93d"
                    },
                  - {
                      - name  = "DOMAIN"
                      - value = "dev-dvsacloud.uk"
                    },
                    {
                        name  = "ENVIRONMENT_NAME"
                        value = "DEV"
                    },
                    {
                        name  = "FULL_DOMAIN"
                        value = "dev.olcs.dev-dvsacloud.uk"
                    },
                  + {
                      + name  = "DOMAIN"
                      + value = "dev-dvsacloud.uk"
                    },
                  + {
                      + name  = "READDB_HOST"
                      + value = "olcsreaddb-rds.dev.olcs.dev-dvsacloud.uk"
                    },
                    {
                        name  = "PROXY"
                        value = "proxy.dev.olcs.dev-dvsacloud.uk:3128"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "cedac7a93d"
                    },
                    {
                        name  = "READDB_HOST"
                        value = "olcsreaddb-rds.dev.olcs.dev-dvsacloud.uk"
                    },
                ]
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (8 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-populate-anondb:244"
        name                       = "vol-app-dev-populate-anondb"
      ~ revision                   = 244 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["sas-mi-extract"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-sas-mi-extract:244" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  - {
                      - name  = "APP_VERSION"
                      - value = "cedac7a93d"
                    },
                  - {
                      - name  = "DOMAIN"
                      - value = "dev-dvsacloud.uk"
                    },
                    {
                        name  = "ENVIRONMENT_NAME"
                        value = "DEV"
                    },
                    {
                        name  = "FULL_DOMAIN"
                        value = "dev.olcs.dev-dvsacloud.uk"
                    },
                  + {
                      + name  = "DOMAIN"
                      + value = "dev-dvsacloud.uk"
                    },
                  + {
                      + name  = "READDB_HOST"
                      + value = "olcsreaddb-rds.dev.olcs.dev-dvsacloud.uk"
                    },
                    {
                        name  = "PROXY"
                        value = "proxy.dev.olcs.dev-dvsacloud.uk:3128"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "cedac7a93d"
                    },
                    {
                        name  = "READDB_HOST"
                        value = "olcsreaddb-rds.dev.olcs.dev-dvsacloud.uk"
                    },
                ]
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (8 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-sas-mi-extract:244"
        name                       = "vol-app-dev-sas-mi-extract"
      ~ revision                   = 244 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.eventbridge.data.aws_iam_policy_document.additional_inline[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "additional_inline" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "batch:SubmitJob",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-cancel-unsubmitted-bilateral:301",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-ch-vs-olcs-diffs:301",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-clean-up-variations:301",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-close-expired-windows:302",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-cns:301",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-company-profile-dlq:302",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-create-psv-licence-surrender-task:301",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-data-retention-delete:302",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-data-retention-populate:301",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-data-retention-postcheck:302",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-data-retention-precheck:302",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-database-maintenance:301",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-digital-continuation-reminders:301",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-duplicate-vehicle-removal:12",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-duplicate-vehicle-warning:301",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-enqueue-ch-compare:301",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-expire-bus-registration:301",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-flag-urgent-tasks:301",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-import-users-from-csv:301",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-inspection-request-email:301",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-interim-end-date-enforcement:301",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-international-goods-export:302",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-last-tm-letter:302",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-licence-status-rules:301",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-liquibase:7",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-mark-expired-permits:302",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-cl:301",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-company-profile:302",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-inbox:301",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-insolvency-dlq:302",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-insolvency:302",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-ntu:301",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-community-licences:301",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-disc-generation:301",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-disc-print:301",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-ecmt-accept:301",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-general:304",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-irhp-allocate:301",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-permit-generation:301",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-permit-print:301",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-print:301",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-psv-operator-list-export:305",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-remove-read-audit:301",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-resolve-payments:301",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-system-parameter:301",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-transxchange-consumer:304",
              + "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default",
              + "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-liquibase",
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
          + sid       = "batch"
        }
    }

  # module.service.module.eventbridge.aws_iam_policy.additional_inline[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional_inline" {
        id               = "arn:aws:iam::054614622558:policy/vol-app-dev-batch-scheduler-inline"
        name             = "vol-app-dev-batch-scheduler-inline"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "batch:SubmitJob"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-liquibase",
                          - "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-transxchange-consumer:304",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-system-parameter:301",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-sas-mi-extract:244",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-resolve-payments:301",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-remove-read-audit:301",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-psv-operator-list-export:305",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-print:301",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-permit-print:301",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-permit-generation:301",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-irhp-allocate:301",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-general:304",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-ecmt-accept:301",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-disc-print:301",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-disc-generation:301",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-community-licences:301",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-ntu:301",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-insolvency:302",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-insolvency-dlq:302",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-inbox:301",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-company-profile:302",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-cl:301",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-populate-anondb:244",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-ni-compliance:244",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-mark-expired-permits:302",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-liquibase:7",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-licence-status-rules:301",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-last-tm-letter:302",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-international-goods-export:302",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-interim-end-date-enforcement:301",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-inspection-request-email:301",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-import-users-from-csv:301",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-import-anondb:244",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-flag-urgent-tasks:301",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-expire-bus-registration:301",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-enqueue-ch-compare:301",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-duplicate-vehicle-warning:301",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-duplicate-vehicle-removal:12",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-digital-continuation-reminders:301",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-database-maintenance:301",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-data-retention-precheck:302",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-data-retention-postcheck:302",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-data-retention-populate:301",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-data-retention-delete:302",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-create-psv-licence-surrender-task:301",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-company-profile-dlq:302",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-cns:301",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-close-expired-windows:302",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-clean-up-variations:301",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-ch-vs-olcs-diffs:301",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-cancel-unsubmitted-bilateral:301",
                        ]
                      - Sid      = "batch"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "Name" = "vol-app-dev-batch-scheduler-inline"
        }
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 5 to change, 0 to destroy.

```

</details>